Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/jobseekers_benefit_and_work.html.txt.tmx
Source language: en
Languages: ga

source: Your spouse’s, civil partner’s or cohabitant's income from all sources is added together to find out if you qualify for an increase in your Jobseeker’s Benefit
ga: Déantar ioncam do chéile, páirtnéir sibhialta nó comhchónaitheoir ó gach foinse a shuimiú le chéile chun fáil amach an gcáilíonn tú do mhéadú i do Shochar Cuardaitheora Poist

source: Employment: Your spouse’s, civil partner’s or cohabitant's average weekly income from employment is assessed
ga: Déantar meánioncam fostaíochta do chéile, páirtnéir sibhialta nó comhchónaitheoir a mheasúnú (déantar an ollioncam seachtainiúil a mheasúnú, ní cheadaítear asbhaintí ar bith do cháin, ranníocaíochtaí ÁSPC nó costais phearsanta)

source: The gross weekly income is assessed and no deductions are allowed for tax, PRSI contributions or personal expenses
ga: Má íoctar do chéile, páirtnéir sibhialta nó comhchónaitheoir ar bhonn míosúil, ríomhtar an meáníocaíocht sheachtainiúil thar an dá mhí roimhe

source: If your spouse's, civil partner's or cohabitant's income is paid monthly, the weekly average over the previous two months is calculated
ga: Má íoctar é nó í go seachtainiúil nó gach coicíse, úsáidtear an meáníocaíocht sheachtainiúil thar na sé seachtaine roimhe sin

source: Self-employment: To calculate earnings from self-employment the income received in the last completed tax year is divided by 52 to get the average weekly income
ga: Chun íocaíocht ó fhéinfhostaíocht a ríomh, roinntear an t-ioncam a fuarthas sa bhliain cánach iomlán seo caite ar 52 chun an meánioncam seachtainiúil a fháil

source: Earnings are assessed as gross income less allowable expenses over 12 months
ga: Déantar na tuillimh a mheasúnú mar ollioncam lúide na costais thar tréimhse 12 mhí

source: Annual earnings from self-employment are divided by 52 to find your weekly means from self-employment
ga: Déantar do thuillimh bhliantúla ó fhéinfhostaíocht a roinnt faoi 52 chun d’acmhainní seachtainiúla ó fhéinfhostaíocht a fháil

source: Any ‘drawings’ you take from the business is not an allowable expense
ga: Níl ‘tarraingtí’ ar bith a bhaintear ón ghnó incheadaithe mar chostas

source: Income from capital, for example, property, savings and investments, is included in the mean test
ga: Áirítear ioncam ó chaipiteal sa tástáil mhaoine - maoin, coigiltis agus infheistíochtaí mar shampla

source: Where capital is held jointly, half of the value is assessed as belonging to your spouse, civil partner or cohabitant. You can find out more about how capital is assessed in the means test
ga: Nuair atá comhúinéireacht ar chaipiteal idir tú féin agus do chéile, páirtnéir sibhialta nó comhchónaitheoir déantar leath den luach a mheasúnú mar mhaoin do chéile, páirtnéir sibhialta nó comhchónaitheoir

source: Income from other sources
ga: Ioncam ó fhoinsí eile

source: Income from other sources includes rental income from the letting of property, income from an occupational pension, foreign social welfare payments, income from a trust fund, income under a deed of covenant and other cash income
ga: Clúdaíonn ioncam ó fhoinsí eile ioncam cíosa ó maoin atá ligthe ar cíos, ioncam ó phinsean ceirde, íocaíochtaí leasa shóisialaigh eachtracha, ioncam ó chiste iontaobhais, ioncam faoi ghníomhas cúnaint, ioncam airgead tirim eile, srl

source: It is calculated on a weekly basis
ga: Ríomhtar é ar bhonn seachtainiúil
